Tutotial 14 - Roundoff Error in OpenFOAM/Case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fcEvaporationFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5; //10; //25000;//50000;

deltaT          1e-4; //1e-4; //1e-5;

writeControl    adjustableRunTime;

writeInterval   0.1; //5000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

CFL            Coats;

maxCo           0.75;

dSmax           1;

maxDeltaT	100;

eventTimeTracking true;

// ************************************************************************* //
